Core/src/Documents/НачислениеНалоговыхЛгот/НачислениеНалоговыхЛгот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НачислениеНалоговыхЛгот</name>
  <registerRecords>InformationRegister.НалоговыеЛготыИнформация</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПодоходного</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/ТипыСтруктурныхЕдиниц/ТипыСтруктурныхЕдиниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСтруктурныхЕдиниц</name>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>Розница</name>
  </enumValues>
  <enumValues>
    <name>РозницаСуммовойУчет</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/НачислениеНалоговыхЛгот/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьПодрозделенияНаСервере()
	
	Объект.Подразделения.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтруктурныеЕдиницы.Ссылка КАК Подразделение,
				   |    &ПроцентПодоходного КАК ПроцентПодоходного
	               |ИЗ
	               |	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	               |ГДЕ
	               |	СтруктурныеЕдиницы.ПометкаУдаления = ЛОЖЬ
	               |	И СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы = &ТипСтруктурнойЕдиницы";
	
	Запрос.УстановитьПараметр("ТипСтруктурнойЕдиницы",Перечисления.ТипыСтруктурныхЕдиниц.Подразделение);
	Запрос.УстановитьПараметр("ПроцентПодоходного",Процент);	
	
    Объект.Подразделения.Загрузить(Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодрозделения(Команда)
	ЗаполнитьПодрозделенияНаСервере();
КонецПроцедуры
